Tekla.Structures.Dialog.UIControls.ComponentCatalog
The ComponentCatalog class represents a group of controls to select components
using the component catalog.

Tekla.Structures.Dialog.UIControls.ComponentCatalog.selectedName
field for selected name

Tekla.Structures.Dialog.UIControls.ComponentCatalog.selectedNumber
field for selected number

Tekla.Structures.Dialog.UIControls.ComponentCatalog.selectButton
select button

Tekla.Structures.Dialog.UIControls.ComponentCatalog.#ctor
Initializes a new instance of the ComponentCatalog class.

Tekla.Structures.Dialog.UIControls.ComponentCatalog.SelectClicked
The SelectClicked event is raised when the Select button is clicked.

Tekla.Structures.Dialog.UIControls.ComponentCatalog.SelectionDone
The SelectionDone event is raised when the selection has been done.
Remarks:
Please note that when filling in controls programmatically, the bound attribute is not stored automatically.
The attribute has to be set using the Tekla.Structures.Dialog.FormBase.SetAttributeValue(System.Windows.Forms.Control,System.Object) method of
the Tekla.Structures.Dialog.FormBase class.

Tekla.Structures.Dialog.UIControls.ComponentCatalog.SelectedName
Gets or sets the selected component name in the control.

Tekla.Structures.Dialog.UIControls.ComponentCatalog.SelectedNumber
Gets or sets the selected component number in the control.

Tekla.Structures.Dialog.UIControls.ComponentCatalog.SelectedComponentType
Gets or sets the selected component type in the control.

Tekla.Structures.Dialog.UIControls.ComponentCatalog.OnLoad(System.EventArgs)
When the load event is raised, the control begins to enumerate through the component catalog.
eventArgs: The event arguments.

Tekla.Structures.Dialog.UIControls.ComponentCatalog.ShowPicker(System.Object,System.EventArgs)
Opens the component catalog dialog in picker mode for selecting a component
sender: The sender.
args: The System.EventArgs instance containing the event data.

Tekla.Structures.Dialog.UIControls.ComponentCatalog.OnSelectClicked(System.Object,System.EventArgs)
Opens the component catalog dialog for selecting a component
sender: The sender.
eventArgs: The event arguments.

Tekla.Structures.Dialog.UIControls.ComponentCatalog.InitializeComponent
Initialization of control